# Проект 0. GitHub. Быстрый старт.

## Условие
Компьютер загадывает целое число от 1 до 100, и нам его нужно угадать.
Под «угадать», конечно, подразумевается «написать программу, которая угадывает число».

## Задача
Написать программу, которая угадывает число за минимальное количество попыток.


Ниже представлен готовый код, который вы можете запустить, чтобы сыграть с компьютером:

```
def score_game(game_core):
    '''Запускаем игру 1000 раз, чтобы узнать, как быстро игра угадывает число'''
    count_ls = []
    np.random.seed(1)  # фиксируем RANDOM SEED, чтобы ваш эксперимент был воспроизводим!
    random_array = np.random.randint(1,101, size=(1000))
    for number in random_array:
        count_ls.append(game_core(number))
    score = int(np.mean(count_ls))
    print(f"Ваш алгоритм угадывает число в среднем за {score} попыток")
    return(score)
```
